# Ultralytics YOLOv11 Architecture
# Custom: Added InterpretationProjection layer
nc: 80  # number of classes
scales:
  s: [0.33, 0.50, 1024] # [depth, width, max_channels]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [1024, True, 0.25]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2, [1024, True, 0.25]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, C3k2, [1024, True, 0.25]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [256, False, 0.25]]
  
  # Interpretation Layer injection point
  - [-1, 1, InterpretationProjection, [128, 1024]] 
  
  # Standard Detection/Segmentation Heads
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # Concat downsampled P3 with P4 out
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True, 0.25]]
  
  - [[17, 20, 23], 1, Segment, [nc, 32, 256]]
